{"parshas":[{"author":"Haim Poyzner","cong":"Richmond Torah Center","contact":"jeffpoyzner@yahoo.com","id":"0","index":0,"name":"Bereishis","text":"The first parsha means a lot to me. At times during the whole year, I find myself looking forward to the day we read from Bereishis. It gives me a sense of renewal; a new chance to refresh my knowledge. I often remember past times at new congregations on Shabbat Bereishis. They have given me a sense of belonging to a community as well a Torah scroll. The clocks of Torah wisdom are rewound in my head and a new understanding, together with the congregation, can now take root. It’s a rare freshness that comes once a year, and when you love the Torah, it can be quite fulfilling.\n\nThe best part about it is that it starts from the creation of the world. The Torah doesn’t just explain events in the history of mankind. It goes back way further. And the more you read it, the more you realize how important the part we play in our lives is. It makes it clear what God wants from us; and as for the parts that aren’t clear: well, let’s just say that you’ll have to keep reading to find out the details. For the intellectuals in the world, it is a source of answers. This parsha definitely attracts me to inspect every letter and word, and opens the door for my curiosity to wander about the rest of the Torah, as well.\n\nI have spent various parts of my life questioning my existence. But this is no longer the case. This parsha has undoubtedly explained what I am doing here on Earth. I have seen how people can be very imperfect in my lifetime, and this also, has been somewhat explained to me in this parsha. The behavior of mankind has not been ideal, and it is obvious that this is not what God wants. So to me, the answer to why people behave wickedly, is simply that they don’t have the proper knowledge of Bereishis and the rest of the Torah. If they did, they would realize that they are going against the wishes of the Almighty, and that’s a losing battle in my book."},{"author":"","cong":"","id":"1","index":1,"name":"Noach","text":""},{"index":2,"name":"Lech Lecha","text":""},{"index":3,"name":"Vayeira","text":""},{"index":4,"name":"Chayei Sarah","text":""},{"index":5,"name":"Toldos","text":""},{"index":6,"name":"Vayeitzei","text":""},{"index":7,"name":"Vayishlach","text":""},{"index":8,"name":"Vayeishev","text":""},{"author":"","cong":"","contact":"","id":"9","index":9,"name":"Mikeitz","text":""},{"index":10,"name":"Vayigash","text":""},{"index":11,"name":"Vayechi","text":""},{"index":12,"name":"Shemos","text":""},{"index":13,"name":"Va'eira","text":""},{"index":14,"name":"Bo","text":""},{"index":15,"name":"Beshalach","text":""},{"index":16,"name":"Yisro","text":""},{"index":17,"name":"Mishpatim","text":""},{"index":18,"name":"Terumah","text":""},{"index":19,"name":"Tetzaveh","text":""},{"index":20,"name":"Ki Sisa","text":""},{"index":21,"name":"Vayakhel","text":""},{"index":22,"name":"Pekudei","text":""},{"index":23,"name":"Vayikra","text":""},{"index":24,"name":"Tzav","text":""},{"index":25,"name":"Shemini","text":""},{"index":26,"name":"Tazria","text":""},{"index":27,"name":"Metzora","text":""},{"index":28,"name":"Acharei","text":""},{"index":29,"name":"Kedoshim","text":""},{"index":30,"name":"Emor","text":""},{"index":31,"name":"Behar","text":""},{"index":32,"name":"Bechukosai","text":""},{"index":33,"name":"Bamidbar","text":""},{"index":34,"name":"Nasso","text":""},{"index":35,"name":"Beha'aloscha","text":""},{"index":36,"name":"Shelach","text":""},{"index":37,"name":"Korach","text":""},{"index":38,"name":"Chukas","text":""},{"index":39,"name":"Balak","text":""},{"index":40,"name":"Pinchas","text":""},{"index":41,"name":"Mattos","text":""},{"index":42,"name":"Masei","text":""},{"index":43,"name":"Devarim","text":""},{"index":44,"name":"Va'eschanan","text":""},{"index":45,"name":"Eikev","text":""},{"index":46,"name":"Re'eh","text":""},{"index":47,"name":"Shoftim","text":""},{"index":48,"name":"Ki Seitzei","text":""},{"index":49,"name":"Ki Savo","text":""},{"author":"Mordechai Hecht","cong":"Rabbi Goldman","contact":"mordyhechT@gmail.com","id":"50","index":50,"name":"Nitzavim","text":"This Torah portion, which incidentally is always read before Rosh Hashana, the Jewish new year, has a famous verse where Moses exhorts the jewish people, and here I quote \"I have set before you life and death, blessings and curses. And you shall choose life, so that you and your children may live (Deuteronomy 30:19).\n   \n   The obvious question is what kind of choice was Moses giving the Jewish people? Obviously, when given the choice between life or death anyone in their right mind will choose life, so what kind of message was Moses trying to impart to the Jewish people then? Because we know that the Torah is eternal its messages are eternal as well, so what is the meaning of this missive: choose life!!! \n\n    A possible insight into the message Moses was trying to impart to the Jewish people can be understood when we think about the meaning of life. There are many ways one can be alive. For example, a person who is, G-D forbid, in a vegetative state. That person may be alive, but his life isn't obviously comparable to someone who is healthy. There are other people who, for example, are consumed by one passion: to get revenge on someone who wronged them. Again, that person may be alive, but one cannot really compare that person's quality of life to someone who is living life to the fullest. \n\n    When one truly thinks about life, one can begin to see divisions in those people who are alive. There are people who are alive purely because they aren't dead, while there are others who embrace being alive and enjoy every minute of it. \n\n   Perhaps this is the inner meaning behind Moses' exhortation to Jews choose life. What Moses was trying to tell the Jewish people is that they shouldn't just be alive by default because they aren't dead, but that they must actively choose to be alive.\n\n    Obviously, for Jews, because we are alive only by the Torah this is a reminder for us to be actively Jewish. A well known story is that when the Romans outlawed Jewish practice on pain of death, Jews came to Rabbi Akiva, the most eminent Torah sage of his generation whom the Romans later cruelly murdered for teaching Torah, and asked him what should we do? How can he publicly continue to teach Torah in the face of the decree. He responded by giving over the following parable: A fox by a stream of water noticed the fish therein scurrying about. The fox asked the fish why they are rushing by so, and they responded that they are trying to escape the nets fisherman cast into the water to catch them. The fox then asked the fish why don't they just leave the water to which the fish responded how foolish the fox must be because as bad as it may be in the water, the water is still life for them, whereas dry land means instant death. And Rabbi Akiva said the same thing is for Jews. The Torah, which symbolizes water, is our life, and so as difficult as it may be to keep the Torah its infinitely worse to leave the Torah because for a Jew that is instant (spiritual) death. And so Moses was reminding the Jews to keep the Torah because that is the only way a Jew can truly be alive.\n\n    This message is especially relevant to Rosh Hashana when we ask G-D to bless us with life. Its important to remember that when asking for life we mean a Jewish life. Hopefully when we ask G-D for that and G-D sees our sincerity and desire to serve him, G-D will bless us with a wonderful Jewish year.       "},{"index":51,"name":"Vayeilech","text":""},{"index":52,"name":"Haazinu","text":""},{"author":"","cong":"","contact":"","id":"53","index":53,"name":"Vezos Haberachah","text":""}]}